import React, { useState } from "react";
import { IoIosArrowDown } from "react-icons/io";
import { Link } from "react-router-dom";

interface MoreItemType {
    title: string;
    desc: string[] | string;
}

const MoreItems: MoreItemType[] = [
    {
        title: "مراحل و نحوه‌ی استفاده از امکانات جاب ویژن",
        desc: "در ادامه، به طور مختصر مراحل و نحوه استفاده از امکاناتی را که سایت کاریابی و استخدامی جاب ویژن در اختیار شما قرار می‌دهد بررسی می‌کنیم.",
    },
    {
        title: "ثبت‌نام در سایت جاب ویژن",
        desc: "برای ارسال رزومه از طریق سایت استخدامی جاب ویژن، ابتدا باید در سایت ثبت نام کنید. برای این کار روی دکمه‌ی ورود/عضویت کلیک کنید. در این جا، کافی است برای ثبت نام، ایمیل خود را وارد کرده و برای حساب کاربری‌تان یک رمز عبور انتخاب نمایید. علاوه بر آن، امکان ثبت‌نام با گوگل و لینکدین نیز به شما داده شده است.",
    },
    {
        title: "ساخت رزومه در سایت جاب ویژن",
        desc: "بعد از ثبت‌نام در سایت، به‌راحتی می‌توانید با رزومه‌ساز آنلاین جاب ویژن، یک رزومه‌ی‌ حرفه‌ای و جذاب بسازید. سرویس ساخت رزومه جاب ویژن، این امکان را به شما می‌دهد که هم‌زمان رزومه فارسی و انگلیسی خود را تکمیل کنید. ساختار استاندارد، طراحی جذاب، یکدست بودن رزومه همه‌ کارجویان و امکان ساخت رایگان از جمله مهم‌ترین امکاناتی است که در این مرحله در اختیار شما قرار داده شده است.",
    },
    {
        title: "ارسال رزومه از طریق سایت کاریابی و استخدام جاب ویژن",
        desc: [
            "در این مرحله می‌توانید با چند کلیک، رزومه خود را برای فرصت‌های شغلی مناسب خودتان در بانک مشاغل جاب ویژن ارسال کنید. برای پیدا کردن این آگهی‌ها به عنوان مثال آگهی های استخدام تهران یا شهرستان، می‌توانید به صفحه فرصت‌های شغلی و یا صفحه فرصت‌های شغلی پیشنهادی مراجعه کرده و آگهی‌های استخدام جدید را مشاهده کنید.",

            "همچنین در این صفحه برای کمک به جستجویی دقیق‌تر و پیدا کردن آگهی استخدام مورد نظرتان، فیلترهای مختلفی قرار داده شده است. برای مثال، با استفاده از فیلتر شهر، می‌توانید آگهی‌های استخدام امروز تهران، فرصت های استخدام اصفهان، تبریز، مشهد، شیراز و شهرهای دیگر را به طور خاص جستجو و مشاهده کنید. بعد از ارسال رزومه باید منتظر بمانید تا کارفرما با شما تماس بگیرد.",

            "پس از اینکه رزومه خود را برای کارفرما ارسال کردید، با ورود به صفحه‌ی پیگیری فرصت‌های شغلی، می‌توانید وضعیت درخواست خود را پیگیری کنید. درخواست‌های شما در یکی از پنج حالت تعیین وضعیت نشده، در حال بررسی، تأیید اولیه برای مصاحبه، رد شده و بسته شده قرار دارد.",
        ],
    },
    {
        title: "افزایش شانس استخدام در شرکت‌های معتبر",
        desc: [
            "شما به عنوان کارجو باید کاری بیشتر از ارسال رزومه انجام دهید. بازار کار رقابتی امروز موجب شده تا برای هر آگهی استخدامی تعداد زیادی رزومه ارسال شود، بنابراین، باید به دنبال راه‌هایی برای متمایز کردن خود در میان این تعداد کارجو باشید. به ویژه در کلانشهری مثل تهران باید برای به دست آوردن موقعیت استخدام و جلب توجه کارفرمایان تلاش مضاعفی انجام داده و خود و توانایی‌هایتان را به کارفرما اثبات کنید.",

            "بالا بردن شانس استخدام با استفاده از امکانات Job vision، افزایش مهارت‌‌ها و یادگیری تخصص‌های لازم، یکی از بهترین‌ راه‌حل‌ها برای موفقیت در مسیر استخدام است. بدون شک داشتن سابقه کار مرتبط و کافی شانس استخدام شما در موقعیت شغلی مورد نظرتان را افزایش خواهد داد، اما عدم تجربه را می‌توانید با گذراندن دوره‌های تخصصی و کارآموزی جبران کنید. امروزه برای این کار لازم نیست هزینه‌ و زمان زیادی صرف کنید. دوره‌های آموزشی آنلاین متعددی وجود دارد که با شرکت در آن‌ها می‌توانید مهارت‌های لازم را کسب کنید.",

            "در سایت کاریابی جاب ویژن در قسمت توانمندتر شو، بهترین دوره‌های آموزشی هر حوزه شغلی از موسسه‌های معتبر کشور با قیمتی پایین‌تر، در اختیار شما قرار گرفته است. با گذراندن این دوره ها از طریق سایت job vision علاوه بر افزایش توانمندی‌هایتان، یک مدال در رزومه شما نیز به کارفرما نمایش داده می‌شود تا شما را از سایرین متمایز کند.",

            "علاوه بر افزایش مهارت‌های سخت، باید بتوانید مهارت‌های نرم خود را نیز افزایش دهید. مهارت‌های نرم درواقع ویژگی‌های شخصیتی و رفتارهایی است که باعث می‌شود با دیگران بهتر تعامل و همکاری داشته باشیم. داشتن مهارت‌های نرم به موفقیت در مصاحبه‌های استخدامی  شرکت ها کمک زیادی می‌کند. برای این کار لازم است به شناخت عمیقی از شخصیت خود برسید تا بتوانید نقاط ضعفتان را شناسایی کنید. علاوه بر این سنجش ویژگی‌های شخصیتی شما برای بسیاری ازکارفرمایان حائز اهمیت است.",

            "به همین دلیل، ما در سایت کاریابی جاب ویژن، 5 آزمون شخصیت شناسی معتبر را در اختیارتان قرار دادیم تا با شرکت در آن‌ها به درک عمیق‌تری از توانمندی‌ها و عدم توانمندی‌های خود برسید.",

            "استخدام شدن و کاریابی همیشه سخت نیست، فقط کافیست تا راه و رسم آن را بلد باشید. ما در این راه کنار شما هستیم تا بتوانید به شغل ایده آل خود برسید.",
        ],
    },
];

const Footer: React.FC = () => {
    const [isMore, setIsMore] = useState(false);
    return (
        <>
            <footer className="text-jv-light pb-5 px-3 bg-jv-gray md:px-10 lg:px-24">
                <article className="py-5 border-b-[1px] border-solid border-jv-light">
                    <div>
                        <h1 className="text-base mb-3 lg:text-2xl">
                            استخدام با معتبرترین سایت کاریابی و استخدامی ایران
                        </h1>
                        <p className="text-xs text-justify leading-5 lg:text-sm">
                            پیدا کردن شغل دلخواه و فرصت استخدام جدید در سازمانی معتبر با شرایط مطلوب کاری آسان نیست.
                            فرآیند پیدا کردن شغل و کاریابی، همواره مسیری با ناهمواری‌های زیاد برای کارجویان بوده و هست.
                            وضعیت نه‌چندان مطلوب بازار کار در ایران از یک طرف و عدم کسب مهارت‌های تخصصی توسط کارجویان از
                            طرف دیگر، این موضوع را به یک مسئله بزرگ در جامعه تبدیل کرده است. همه کارجویان در هر حوزه،
                            شهر، شغل و سنی تمایل به کوتاه و آسان‌تر کردن این مسیر ناهموار و تسریع در استخدام خود دارند.
                            برای موفقیت در این راه به یک رزومه حرفه‌ای، دسترسی به آگهی‌های استخدام
                            {isMore
                                ? " جدید، شناخت سازمان‌ها، مهارت تخصصی و در نهایت ارسال رزومه به فرصت‌های شغلی متناسب با خود نیاز دارید."
                                : "..."}
                        </p>
                    </div>
                    <div
                        className={`wrapper overflow-hidden grid transition-all duration-700 ${
                            isMore ? "grid-rows-[1fr] py-5" : "grid-rows-[0fr]"
                        }`}
                    >
                        <div className={`min-h-0`}>
                            <section className="block mb-16">
                                {MoreItems.map((item) => (
                                    <div className="my-5">
                                        <h1 className="text-sm mb-1 lg:text-xl">{item.title}</h1>
                                        {Array.isArray(item.desc) ? (
                                            item.desc.map((des) => (
                                                <p className="text-xs text-justify leading-5 mb-3 lg:text-sm">{des}</p>
                                            ))
                                        ) : (
                                            <p className="text-xs text-justify leading-5 lg:text-sm">{item.desc}</p>
                                        )}
                                    </div>
                                ))}
                            </section>
                            <section className="block mb-16">
                                <h1 className="text-2xl">لینک‌های مرتبط</h1>
                                <ul className="flex my-5">
                                    <li className="ml-5">
                                        <Link
                                            className="text-xs text-inherit hover:text-jv-primary lg:text-sm"
                                            style={{ textDecoration: "underline" }}
                                            to=""
                                        >
                                            استخدام کارگزاری
                                        </Link>
                                    </li>
                                    <li className="ml-5">
                                        <Link
                                            className="text-xs text-inherit hover:text-jv-primary lg:text-sm"
                                            style={{ textDecoration: "underline" }}
                                            to=""
                                        >
                                            استخدام بیمه
                                        </Link>
                                    </li>
                                    <li className="ml-5">
                                        <Link
                                            className="text-xs text-inherit hover:text-jv-primary lg:text-sm"
                                            style={{ textDecoration: "underline" }}
                                            to=""
                                        >
                                            استخدام خودرو
                                        </Link>
                                    </li>
                                </ul>
                            </section>
                            <section className="block mb-16">
                                <h1 className="text-2xl">آخرین مطالب بلاگ</h1>
                                <ul className="my-5 grid grid-cols-3">
                                    <li className="col-span-3 m-2 py-3 rounded-xl bg-jv-lightGray lg:col-span-1">
                                        <Link
                                            className="w-full h-full text-inherit flex items-center justify-center"
                                            to=""
                                        >
                                            راهنمای جامع استخدام
                                        </Link>
                                    </li>
                                    <li className="col-span-3 m-2 py-3 rounded-xl bg-jv-lightGray lg:col-span-1">
                                        <Link
                                            className="w-full h-full text-inherit flex items-center justify-center"
                                            to=""
                                        >
                                            راهنمای جامع رزومه نویسی برای کارجویان
                                        </Link>
                                    </li>
                                    <li className="col-span-3 m-2 py-3 rounded-xl bg-jv-lightGray lg:col-span-1">
                                        <Link
                                            className="w-full h-full text-inherit flex items-center justify-center"
                                            to=""
                                        >
                                            گزارش افزایش حقوق 1402 کارگران
                                        </Link>
                                    </li>
                                </ul>
                            </section>
                        </div>
                    </div>
                    <div className="w-full flex items-center justify-center my-2">
                        <div
                            onClick={() => setIsMore((prev) => !prev)}
                            className="transition-all duration-300 flex items-center justify-center cursor-pointer"
                        >
                            <span className="text-xs px-3">{isMore ? "مشاهده کمتر" : "مشاهده بیشتر"}</span>
                            <IoIosArrowDown className={`${isMore ? "rotate-180" : ""} text-xs`}></IoIosArrowDown>
                        </div>
                    </div>
                </article>
                <div className="py-5 border-b-[1px] border-solid border-jv-light"></div>
            </footer>
        </>
    );
};

export default Footer;
